app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.all
---
SELECT * FROM `tweets` ORDER BY created_at DESC

  def create
    @tweet = Tweet.new(params[:tweet])
    @tweet.user_id = session[:user_id]
    respond_to do |format|
      if @tweet.save
---
INSERT INTO `tweets` (`created_at`, `published`, `updated_at`, `text`, `user_id`, `status_id`) VALUES('2010-09-14 23:56:20', 0, '2010-09-14 23:56:20', 'Test, 1,2,3', 1, NULL)

  def destroy
    @tweet = Tweet.find(params[:id])

    if session[:user_id] != @tweet.user_id or session[:user_is_admin] == false
      flash[:notice] = "Only a tweets owner can delete it!"
      redirect_to :controller => 'tweets', :action => 'index'
    end

    begin
      flash[:notice] = "Tweet has been destroyed."
      @tweet.destroy
---
SELECT * FROM `tweets` WHERE (`tweets`.`id` = 1)
DELETE FROM `tweets` WHERE `id` = 1