app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :name)

INSERT INTO `users` (`name`, `salt`, `created_at`, `updated_at`, `hashed_password`, `is_admin`, `email`) VALUES('tester', '187737800.430352991039407', '2010-09-14 22:59:41', '2010-09-14 22:59:41', 'e369fbf8a46899aeeec387180af870b98229fbe7', 0, 'tester@gmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2010-09-10 00:44:20', `salt` = '184573000.70803223249326', `hashed_password` = '620bc295f98920b635f5c5e05c6d0ffdb4217451' WHERE `id` = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE `id` = 7
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy